Revit 2027 API
WorksharingDisplaySettings.GetGraphicOverrides(CheckoutStatus) Method
 Returns the graphic overrides associated with a particular ownership status.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksharingDisplayGraphicSettings GetGraphicOverrides(
	CheckoutStatus ownershipStatus
)
Public Function GetGraphicOverrides (
	ownershipStatus As CheckoutStatus
) As WorksharingDisplayGraphicSettings
public:
WorksharingDisplayGraphicSettings^ GetGraphicOverrides(
	CheckoutStatus ownershipStatus
)
member GetGraphicOverrides :
        ownershipStatus : CheckoutStatus -> WorksharingDisplayGraphicSettings
Parameters
ownershipStatus CheckoutStatus
 The ownership status of interest.
Return Value
WorksharingDisplayGraphicSettings
 Returns the graphic overrides assigned to a particular ownership status.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
WorksharingDisplaySettings Class
GetGraphicOverrides Overload
Autodesk.Revit.DB Namespace